{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Домашнее задание 4"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Две команды проводили матч по бегу. Итоги соревнований определялись следующим образом: если $k$-ый по силе участник одной из команд обогнал такого же по силе участника другой команды, то этой команде присваивалось очко; если же они показали одинаковые результаты, то по 0,5 очка давалось каждой из команд. Гарантируется, что в обеих командах одинаковое количество человек. Напишите программу, получающую на вход две строчки результатов в формате $mm:ss$, разделённых пробелом, и возвращающую счёт матча."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число участников: 5\n",
      "Время бегуна 1-ой команды: 2:01\n",
      "Время бегуна 2-ой команды: 1:42\n",
      "--------------------------------\n",
      "Время бегуна 1-ой команды: 1:50\n",
      "Время бегуна 2-ой команды: 1:43\n",
      "--------------------------------\n",
      "Время бегуна 1-ой команды: 1:33\n",
      "Время бегуна 2-ой команды: 1:50\n",
      "--------------------------------\n",
      "Время бегуна 1-ой команды: 1:44\n",
      "Время бегуна 2-ой команды: 2:14\n",
      "--------------------------------\n",
      "Время бегуна 1-ой команды: 2:00\n",
      "Время бегуна 2-ой команды: 1:56\n",
      "--------------------------------\n",
      "2:3\n"
     ]
    }
   ],
   "source": [
    "k = int(input('Число участников: '))\n",
    "\n",
    "c1, c2 = 0, 0\n",
    "for i in range(k):\n",
    "    s1 = input('Время бегуна 1-ой команды: ')\n",
    "    s2 = input('Время бегуна 2-ой команды: ')\n",
    "    print('--------------------------------')\n",
    "    s1_time = int(s1.split(':')[0]) * 60 + int(s1.split(':')[1])\n",
    "    s2_time = int(s2.split(':')[0]) * 60 + int(s2.split(':')[1])\n",
    "    if s1_time > s2_time:\n",
    "        c2 += 1\n",
    "    elif s1_time == s2_time:\n",
    "        c1 += 0.5\n",
    "        c2 += 0.5\n",
    "    else:\n",
    "        c1 += 1\n",
    "print('{}:{}'.format(c1, c2))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
